cavity/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

inlet_const 18;
outlet_const 30;

p_xf_r_1_const 125;
p_xs_r_1_const 135;
p_xf_r_2_const 125;
p_xs_r_2_const 135;

inlet 25;
outlet_y 60;

move_xf_rect_1 40;
move_xs_rect_1 40;
move_xf_rect_2 40;
move_xs_rect_2 40;

p_xf_r_1 #calc "$p_xf_r_1_const - $move_xf_rect_1";//1 rect 125 - move
p_xs_r_1 #calc "$p_xs_r_1_const - $move_xs_rect_1";//2 rect 125 - move
p_xf_r_2 #calc "$p_xf_r_2_const - $move_xf_rect_2";//1 rect 135 - move
p_xs_r_2 #calc "$p_xs_r_2_const - $move_xs_rect_2";//2 rect 135 - move

vertices
(
    //first - verh
    (0 $inlet -0.1)//0
    ($p_xf_r_1 15 -0.1)//1
    ($p_xs_r_1 15 -0.1)//2
    (150 $inlet -0.1)//3
    (0 $inlet 0.1)//4
    ($p_xf_r_1 15 0.1)//5
    ($p_xs_r_1 15 0.1)//6
    (150 $inlet 0.1)//7
    //second - left bock
    (0 0 -0.1)//8
    ($p_xf_r_2 5 -0.1)//9
    ($p_xf_r_1 15 -0.1)//10
    (0 $inlet -0.1)//11
    (0 0 0.1)//12
    ($p_xf_r_2 5 0.1)//13
    ($p_xf_r_1 15 0.1)//14
    (0 $inlet 0.1)//15
    //third - niz
    (0 0 -0.1)//16
    (150 0 -0.1)//17
    ($p_xs_r_2 5 -0.1)//18
    ($p_xf_r_2 5 -0.1)//19
    (0 0 0.1)//20
    (150 0 0.1)//21
    ($p_xs_r_2 5 0.1)//22
    ($p_xf_r_2 5 0.1)//23
     //four - right bok
     ($p_xs_r_2 5 -0.1)//24
     (150 0 -0.1)//25
     (150 $inlet -0.1)//26
     ($p_xs_r_2 15 -0.1)//27
     ($p_xs_r_2 5 0.1)//28
     (150 0 0.1)//29
     (150 $inlet 0.1)//30
     ($p_xs_r_2 15 0.10)//31
    //five - rectangle mesh center mezdu rectangle
    ($p_xf_r_2 8 -0.1)//32
    ($p_xs_r_2 8 -0.1)//33
    ($p_xs_r_1 12 -0.1)//34
    ($p_xf_r_1 12 -0.1)//35
    ($p_xf_r_2 8 0.1)//36
    ($p_xs_r_2 8 0.1)//37
    ($p_xs_r_1 12 0.1)//38
    ($p_xf_r_1 12 0.1)//39
    //six - nizn firt rectangle
    (150 0 -0.1)//40
    (180 0 -0.1)//41
    (180 $inlet -0.1)//42
    (150 $inlet -0.1)//43
    (150 0 0.1)//44
    (180 0 0.1)//45
    (180 $inlet 0.1)//46
    (150 $inlet 0.1)//47
    //seven - verhn posl recatngle
    (150 $inlet -0.1)//48
    (180 $inlet -0.1)//49
    (180 $outlet_y -0.1)//50
    (150 $outlet_y -0.1)//51
    (150 $inlet 0.1)//52
    (180 $inlet 0.1)//53
    (180 $outlet_y 0.1)//54
    (150 $outlet_y 0.1)//55
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (20 20 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (20 20 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) (20 20 1) simpleGrading (1 1 1)
    hex (32 33 34 35 36 37 38 39) (20 20 1) simpleGrading (1 1 1)
    hex (40 41 42 43 44 45 46 47) (20 20 1) simpleGrading (1 1 1)
    hex (48 49 50 51 52 53 54 55) (20 20 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 12 11 15)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (41 45 46 42)
            (49 53 54 50)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
        (0 1 2 3)
        (4 5 6 7)
        (8 9 10 11)
        (12 13 14 15)
        (16 17 18 19)
        (20 21 22 23)
        (24 25 26 27)
        (28 29 30 31)
        (32 33 34 35)
        (36 37 38 39)
        (40 41 42 43)
        (44 45 46 47)
        (48 49 50 51)
        (52 53 54 55)
        );
    }
    
    topAndBottom
    {
        type wall;
        faces
        (
        //top
            (0 4 7 3)
            (48 52 55 51)
            (51 55 54 50)
        //bottom
            (16 20 21 17)
            (40 44 45 41)
        );
    }
);


// ************************************************************************* //
